global_esb/src/main/resources/request.xsd

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header >
        <callbackURL xmlns="http://esmt.sn/gesb/soam">http://example.com/callback</callbackURL>
    </Header>
    <Body>
        <esbRootActionRequest requestId="1235864" xmlns="http://esmt.sn/gesb/soam">
            <esbContent verb="ADD">
                <esbParameter name="subscriberName" newValue="Razacki" oldValue = "" />
                <esbParameter name="phoneNumber" newValue="+221785900131" oldValue = "" />
                <esbParameter name="subscriberType" newValue="PRE_PAID" oldValue = "" />
                <esbParameter name="imsi" newValue="10547544" oldValue = "" />
                <esbServices>
                    <esbService verb="ADD">
                        <esbParameter name="serviceType" newValue="SERV_LTE" oldValue="" />
                        <esbParameter name="targetNumber" newValue="" oldValue="" />
                        <esbParameter name="active" newValue="true" oldValue="" />
                    </esbService>
                    <esbService verb="ADD">
                        <esbParameter name="serviceType" newValue="SERV_ROAMING" oldValue="" />
                        <esbParameter name="targetNumber" newValue="" oldValue="" />
                        <esbParameter name="active" newValue="true" oldValue="" />
                    </esbService>
                </esbServices>
            </esbContent>
        </esbRootActionRequest>
    </Body>
</Envelope>